espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/serialization/common/transport/ser_phy/ser_phy_hci.c
static void packet_transmitted_callback(void)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_TX_PKT_SENT(0);

    event.evt_type = SER_PHY_EVT_TX_PKT_SENT;
    ser_phy_event_callback(event);
}


static void error_callback(void)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_TX_ERROR(0);

    event.evt_type = SER_PHY_EVT_HW_ERROR;
    event.evt_params.hw_error.p_buffer = m_p_tx_payload;
    ser_phy_event_callback(event);
}


static void hci_slip_event_handler(ser_phy_hci_slip_evt_t * p_event)
{
    hci_evt_t event;
    uint32_t  packet_type;
    uint32_t  err_code;

    if ( p_event->evt_type == SER_PHY_HCI_SLIP_EVT_PKT_SENT )
    {
        DEBUG_EVT_SLIP_PACKET_TXED(0);
        event.evt_source                    = HCI_SLIP_EVT;
        event.evt.ser_phy_slip_evt.evt_type = p_event->evt_type;
#ifndef HCI_LINK_CONTROL
        hci_tx_event_handler(&event);
#else
        if ((m_hci_mode == HCI_MODE_ACTIVE) && m_hci_other_side_active)
        {
            hci_tx_event_handler(&event);
        }
#endif /*HCI_LINK_CONTROL*/
    }
    else if ( p_event->evt_type == SER_PHY_HCI_SLIP_EVT_ACK_SENT )
    {
        DEBUG_EVT_SLIP_ACK_TXED(0);
        event.evt_source                    = HCI_SLIP_EVT;
        event.evt.ser_phy_slip_evt.evt_type = p_event->evt_type;
#ifndef HCI_LINK_CONTROL
        hci_rx_event_handler(&event);
#else
        if ((m_hci_mode == HCI_MODE_ACTIVE) && m_hci_other_side_active)
        {
            hci_rx_event_handler(&event);
        }
#endif /* HCI_LINK_CONTROL */
    }

    else if ( p_event->evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED )
    {
        event.evt_source = HCI_SLIP_EVT;
        event.evt.ser_phy_slip_evt.evt_type                         = p_event->evt_type;
        event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer =
            p_event->evt_params.received_pkt.p_buffer;
        event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes =
            p_event->evt_params.received_pkt.num_of_bytes;
        ser_phy_hci_assert(event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer != NULL);
        ser_phy_hci_assert(event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes != 0);
        packet_type = packet_type_decode(
            event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer,
            event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes);

        if (packet_type == PKT_TYPE_ACK )
        {
            DEBUG_EVT_SLIP_ACK_RXED(0);
#ifndef HCI_LINK_CONTROL
            hci_tx_event_handler(&event);
#else
            if ((m_hci_mode == HCI_MODE_ACTIVE) && m_hci_other_side_active)
            {
                hci_tx_event_handler(&event);
            }
            else
            {
                err_code = ser_phy_hci_slip_rx_buf_free(
                      event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
            }
#endif /* HCI_LINK_CONTROL */
        }
        else if ( packet_type == PKT_TYPE_VENDOR_SPECIFIC )
        {
            if (is_rx_pkt_valid(event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer,
                                event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes))
            {
                DEBUG_EVT_SLIP_PACKET_RXED(0);
#ifndef HCI_LINK_CONTROL
                hci_rx_event_handler(&event);
#else
                if ((m_hci_mode == HCI_MODE_ACTIVE) && m_hci_other_side_active)
                {
                    hci_rx_event_handler(&event);
                }
                else
                {
                    err_code = ser_phy_hci_slip_rx_buf_free(
                                    event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
                }
#endif /* HCI_LINK_CONTROL */
            }
            else
            {
                err_code = ser_phy_hci_slip_rx_buf_free(
                    event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
                ser_phy_hci_assert(err_code == NRF_SUCCESS);
                /* throw assert when in debug mode*/
                DEBUG_EVT_SLIP_ERR_RXED(0);
            }
        }
#ifdef HCI_LINK_CONTROL
        else if (packet_type == PKT_TYPE_LINK_CONTROL)
        {
            hci_link_control_event_handler(&event);
        }
#endif /* HCI_LINK_CONTROL */
        else
        {
            err_code = ser_phy_hci_slip_rx_buf_free(
                event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
            ser_phy_hci_assert(err_code == NRF_SUCCESS);
            /* throw assert when in debug mode*/
            DEBUG_EVT_SLIP_ERR_RXED(0);
        }
    }

}


static void hci_pkt_send(void)
{
    uint32_t err_code;

    m_tx_packet_header[0] = tx_packet_byte_zero_construct();
    uint16_t type_and_length_fields = ((m_tx_payload_length << 4u) | PKT_TYPE_VENDOR_SPECIFIC);
    (void)uint16_encode(type_and_length_fields, &(m_tx_packet_header[1]));
    m_tx_packet_header[3] = header_checksum_calculate(m_tx_packet_header);
    uint16_t crc = crc16_compute(m_tx_packet_header, PKT_HDR_SIZE, NULL);
    crc = crc16_compute(m_p_tx_payload, m_tx_payload_length, &crc);
    (void)uint16_encode(crc, m_tx_packet_crc);

    ser_phy_hci_pkt_params_t pkt_header;
    ser_phy_hci_pkt_params_t pkt_payload;
    ser_phy_hci_pkt_params_t pkt_crc;

    pkt_header.p_buffer      = m_tx_packet_header;
    pkt_header.num_of_bytes  = PKT_HDR_SIZE;
    pkt_payload.p_buffer     = m_p_tx_payload;
    pkt_payload.num_of_bytes = m_tx_payload_length;
    pkt_crc.p_buffer         = m_tx_packet_crc;
    pkt_crc.num_of_bytes     = PKT_CRC_SIZE;
    DEBUG_EVT_SLIP_PACKET_TX(0);
    err_code = ser_phy_hci_slip_tx_pkt_send(&pkt_header, &pkt_payload, &pkt_crc);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    return;
}

#ifdef HCI_LINK_CONTROL
static void hci_link_control_pkt_send(void)
{
    uint32_t err_code;
    uint16_t link_control_payload_len = 0;

    m_tx_link_control_header[0] = 0x00u;       // SEQ, ACK, DI and RP are set to 0 for link control
    if (m_hci_link_control_next_pkt == HCI_PKT_SYNC)
    {
        link_control_payload_len = HCI_PKT_SYNC_SIZE - PKT_HDR_SIZE;
        (void)uint16_encode(HCI_PKT_SYNC, m_tx_link_control_payload);
    }
    else if (m_hci_link_control_next_pkt == HCI_PKT_SYNC_RSP)
    {
        link_control_payload_len = HCI_PKT_SYNC_SIZE - PKT_HDR_SIZE;
        (void)uint16_encode(HCI_PKT_SYNC_RSP, m_tx_link_control_payload);
    }
    else if (m_hci_link_control_next_pkt == HCI_PKT_CONFIG)
    {
        link_control_payload_len = HCI_PKT_CONFIG_SIZE - PKT_HDR_SIZE;
        (void)uint16_encode(HCI_PKT_CONFIG, m_tx_link_control_payload);
        m_tx_link_control_payload[2] = HCI_CONFIG_FIELD;
    }
    else if (m_hci_link_control_next_pkt == HCI_PKT_CONFIG_RSP)
    {
        link_control_payload_len = HCI_PKT_CONFIG_SIZE - PKT_HDR_SIZE;
        (void)uint16_encode(HCI_PKT_CONFIG_RSP, m_tx_link_control_payload);
        m_tx_link_control_payload[2] = HCI_CONFIG_FIELD;
    }
    uint16_t type_and_length_fields = ((link_control_payload_len << 4u) | PKT_TYPE_LINK_CONTROL);
    (void)uint16_encode(type_and_length_fields, &(m_tx_link_control_header[1]));
    m_tx_link_control_header[3] = header_checksum_calculate(m_tx_link_control_header);

    ser_phy_hci_pkt_params_t pkt_header;
    ser_phy_hci_pkt_params_t pkt_payload;
    ser_phy_hci_pkt_params_t pkt_crc;

    pkt_header.p_buffer      = m_tx_link_control_header;
    pkt_header.num_of_bytes  = PKT_HDR_SIZE;
    pkt_payload.p_buffer     = m_tx_link_control_payload;
    pkt_payload.num_of_bytes = link_control_payload_len;
    pkt_crc.p_buffer         = NULL;
    pkt_crc.num_of_bytes     = 0;
    DEBUG_EVT_SLIP_PACKET_TX(0);
    err_code = ser_phy_hci_slip_tx_pkt_send(&pkt_header, &pkt_payload, &pkt_crc);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    return;
}
#endif /* HCI_LINK_CONTROL */

static void hci_pkt_sent_upcall(void)
{
    m_packet_seq_number++; // incoming ACK is valid, increment SEQ
    m_packet_seq_number &= 0x07u;
    m_p_tx_payload       = NULL;
    packet_transmitted_callback();

    return;
}


