espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/serialization/common/transport/ser_phy/ser_phy_hci.c
#ifdef HCI_LINK_CONTROL
/* Link control event handler - used only for Link Control packets */
/* This handler will be called only in 2 cases:
   - when SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED event is received 
   - when HCI_TIMER_EVT event is reveived */
static void hci_link_control_event_handler(hci_evt_t * p_event)
{
    uint16_t pkt_type = HCI_LINK_CONTROL_PKT_INVALID;

    switch(p_event->evt_source)
    {
        case HCI_SLIP_EVT:
            pkt_type = link_control_packet_decode(
                            p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer,
                            p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes);
            /* Perform HCI mode transition if needed */
            CRITICAL_REGION_ENTER();
            switch (pkt_type)
            {
                case HCI_PKT_SYNC:
                    m_hci_link_control_next_pkt = HCI_PKT_SYNC_RSP;
                    /* Restart HCI communication if it was in ACTIVE mode */
                    if (m_hci_mode == HCI_MODE_ACTIVE)
                    {
                        m_hci_mode          = HCI_MODE_UNINITIALIZED;
                        m_packet_ack_number = INITIAL_ACK_NUMBER_EXPECTED;
                        m_packet_seq_number = INITIAL_SEQ_NUMBER;
                        m_hci_tx_fsm_state  = HCI_TX_STATE_DISABLE;
                        m_hci_rx_fsm_state  = HCI_RX_STATE_DISABLE;
                        m_hci_other_side_active = false;
                    }
                    hci_link_control_pkt_send();
                    hci_timeout_setup(HCI_LINK_CONTROL_TIMEOUT); // Need to trigger transmitting SYNC messages
                    break;
                case HCI_PKT_SYNC_RSP:
                    if (m_hci_mode == HCI_MODE_UNINITIALIZED)
                    {
                        m_hci_mode                  = HCI_MODE_INITIALIZED;
                        m_hci_link_control_next_pkt = HCI_PKT_CONFIG;
                    }
                    break;
                case HCI_PKT_CONFIG:
                    if (m_hci_mode != HCI_MODE_UNINITIALIZED)
                    {
                        m_hci_link_control_next_pkt = HCI_PKT_CONFIG_RSP;
                        hci_link_control_pkt_send();
                        m_hci_other_side_active = true;
                    }
                    break;
                case HCI_PKT_CONFIG_RSP:
                    if (m_hci_mode == HCI_MODE_INITIALIZED)
                    {
                        m_hci_mode          = HCI_MODE_ACTIVE;
                        m_hci_tx_fsm_state  = HCI_TX_STATE_SEND;
                        m_hci_rx_fsm_state  = HCI_RX_STATE_RECEIVE;                        
                    }
                    break;
            }
            CRITICAL_REGION_EXIT();
            (void) ser_phy_hci_slip_rx_buf_free(
                p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
            /* Kick the state machine so it can start process BLE packets */
            if ((m_hci_mode == HCI_MODE_ACTIVE) && m_hci_other_side_active)
            {
                hci_tx_reschedule();
                hci_rx_reschedule();
            }
            break;

        case HCI_TIMER_EVT:
            /* Send one of the Link Control packets if in Unintialized or Initialized state */
            CRITICAL_REGION_ENTER();
            switch (m_hci_mode)
            {
                case HCI_MODE_UNINITIALIZED:
                    //send packet
                    m_hci_link_control_next_pkt = HCI_PKT_SYNC;
                    hci_link_control_pkt_send();
                    hci_timeout_setup(HCI_LINK_CONTROL_TIMEOUT);
                    break;
                case HCI_MODE_INITIALIZED:
                    m_hci_link_control_next_pkt = HCI_PKT_CONFIG;
                    hci_link_control_pkt_send();
                    hci_timeout_setup(HCI_LINK_CONTROL_TIMEOUT);
                    break;
                case HCI_MODE_ACTIVE:
                case HCI_MODE_DISABLE:
                default:
                    // No implementation needed
                    break;
            }
            CRITICAL_REGION_EXIT();
            break;
        case HCI_SER_PHY_EVT:
        default:
            // No implementation needed
            break;
    }
}
#endif /* HCI_LINK_CONTROL */

/* ser_phy API function */
void ser_phy_interrupts_enable(void)
{
    bool pending_timer_callback_flag = false;

    CRITICAL_REGION_ENTER();
    m_hci_timer_enabled_flag = true;

    if (m_hci_timout_pending_flag)
    {
        m_hci_timout_pending_flag   = false;
        pending_timer_callback_flag = true;
    }
    CRITICAL_REGION_EXIT();
    // this is a workaround - scheduled SER_PHY EVENTS
    m_hci_global_enable_flag = true;
    hci_tx_reschedule();
    hci_rx_reschedule();

    if (pending_timer_callback_flag)
    {
        hci_signal_timeout_event();
    }

    return;
}


/* ser_phy API function */
void ser_phy_interrupts_disable(void)
{
    CRITICAL_REGION_ENTER();
    m_hci_timer_enabled_flag = false;
    // transport calls PHY API with ser_phy_interrupts_disabled
    m_hci_global_enable_flag = false;
    CRITICAL_REGION_EXIT();
}


/* ser_phy API function */
uint32_t ser_phy_rx_buf_set(uint8_t * p_buffer)
{
    uint32_t  status = NRF_SUCCESS;
    hci_evt_t event;

    if (m_buffer_reqested_flag)
    {
        m_buffer_reqested_flag         = false;
        m_p_rx_buffer                  = p_buffer;
        event.evt_source               = HCI_SER_PHY_EVT;
        event.evt.ser_phy_evt.evt_type = HCI_SER_PHY_RX_BUF_GRANTED;
        hci_rx_event_handler(&event);
    }
    else
    {
        status = NRF_ERROR_BUSY;
    }
    return status;
}


/* ser_phy API function */
uint32_t ser_phy_tx_pkt_send(const uint8_t * p_buffer, uint16_t num_of_bytes)
{
    uint32_t  status = NRF_SUCCESS;
    hci_evt_t event;

    if ( p_buffer == NULL || num_of_bytes == 0)
    {
        return NRF_ERROR_NULL;
    }

    if ( m_p_tx_payload == NULL)
    {
        m_tx_payload_length = num_of_bytes;
        m_p_tx_payload      = (uint8_t *)p_buffer;
        DEBUG_EVT_TX_REQ(0);
        event.evt_source               = HCI_SER_PHY_EVT;
        event.evt.ser_phy_evt.evt_type = HCI_SER_PHY_TX_REQUEST;
        hci_tx_event_handler(&event);
    }
    else
    {
        status = NRF_ERROR_BUSY;
    }

