espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/serialization/common/transport/ser_phy/ser_phy_hci.c
    return status;
}


static uint32_t  hci_timer_init(void)
{
    uint32_t err_code = NRF_SUCCESS;

#ifdef HCI_APP_TIMER

    err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, hci_timeout_handler);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = app_timer_start(m_app_timer_id, RETRANSMISSION_TIMEOUT_IN_TICKS, NULL);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

#else

    // Configure TIMER for compare[1] event
    HCI_TIMER->PRESCALER = 9;
    HCI_TIMER->MODE      = TIMER_MODE_MODE_Timer;
    HCI_TIMER->BITMODE   = TIMER_BITMODE_BITMODE_16Bit;

    // Clear TIMER
    HCI_TIMER->TASKS_CLEAR = 1;

    // Enable interrupt
    HCI_TIMER->INTENCLR = 0xFFFFFFFF;
    HCI_TIMER->INTENSET = TIMER_INTENSET_COMPARE1_Enabled << TIMER_INTENSET_COMPARE1_Pos;

    NVIC_ClearPendingIRQ(HCI_TIMER_IRQn);
    NVIC_SetPriority(HCI_TIMER_IRQn, APP_IRQ_PRIORITY_HIGH);
    NVIC_EnableIRQ(HCI_TIMER_IRQn);

#endif

    return err_code;

}


/* ser_phy API function */
uint32_t ser_phy_open(ser_phy_events_handler_t events_handler)
{
    uint32_t err_code;

    if ((m_hci_tx_fsm_state != HCI_TX_STATE_DISABLE) || (m_hci_rx_fsm_state != HCI_RX_STATE_DISABLE))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (events_handler == NULL)
    {
        return NRF_ERROR_NULL;
    }

    err_code = hci_timer_init();

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = app_mailbox_create(&tx_evt_queue);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = app_mailbox_create(&rx_evt_queue);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = ser_phy_hci_slip_open(hci_slip_event_handler);

    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    if (err_code == NRF_SUCCESS)
    {
        m_packet_ack_number = INITIAL_ACK_NUMBER_EXPECTED;
        m_packet_seq_number = INITIAL_SEQ_NUMBER;
        m_ser_phy_callback  = events_handler;

#ifndef HCI_LINK_CONTROL
        m_hci_tx_fsm_state  = HCI_TX_STATE_SEND;
        m_hci_rx_fsm_state  = HCI_RX_STATE_RECEIVE;
#else
        hci_timeout_setup(HCI_LINK_CONTROL_TIMEOUT);// Trigger sending SYNC messages
        m_hci_mode              = HCI_MODE_UNINITIALIZED;
        m_hci_other_side_active = false;
#endif /*HCI_LINK_CONTROL*/
    }
    return err_code;
}

static uint32_t hci_timer_close(void)
{
    uint32_t err_code = NRF_SUCCESS;

#ifdef HCI_APP_TIMER
    err_code = app_timer_stop(m_app_timer_id);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
#endif

    return err_code;
}

/* ser_phy API function */
void ser_phy_close(void)
{
    m_ser_phy_callback = NULL;
    ser_phy_hci_slip_close();
    m_hci_tx_fsm_state = HCI_TX_STATE_DISABLE;
    m_hci_rx_fsm_state = HCI_RX_STATE_DISABLE;

#ifdef HCI_LINK_CONTROL
    m_hci_mode         = HCI_MODE_DISABLE;
#endif /* HCI_LINK_CONTROL */

    uint32_t err_code = hci_timer_close();
    ser_phy_hci_assert(err_code == NRF_SUCCESS);
}


